In [1]:
import numpy as np
import pandas as pd

In [7]:
df = pd.read_clipboard()

In [8]:
df.head(3)          # 获取前3个，默认为5

   排名     中文名       财富  年龄     财富来源  国家
0   1  杰夫·贝索斯  1284亿美元  54      亚马逊  美国
1   2   比尔·盖茨   915亿美元  62       微软  美国
2   3  沃伦·巴菲特   879亿美元  87  伯克希尔哈撒韦  美国

In [9]:
df.tail(3)            # 获取后3个，默认为5

      排名      中文名     财富  年龄    财富来源   国家
198  199  斯坦利·克伦克  83亿美元  70  体育，房地产   美国
199  200   泽维尔·尼尔  83亿美元  50  互联网，通信   法国
200  201   詹姆斯·欧文  83亿美元  89   多元化经营  加拿大

In [10]:
df.head(3)[['排名','中文名']]   #过滤获取特定列

   排名     中文名
0   1  杰夫·贝索斯
1   2   比尔·盖茨
2   3  沃伦·巴菲特

In [11]:
sub_df = df[['排名','中文名']]

### 根据index

In [14]:
sub_df.iloc[10:20]      # 显示10到20行

    排名        中文名
10  11      拉里·佩奇
11  12   迈克尔·布隆伯格
12  13     谢尔盖·布林
13  14        马化腾
14  15    梅耶尔-贝当古
15  16     吉姆·沃尔顿
16  17  S.罗伯森·沃尔顿
17  18    艾丽斯·沃尔顿
18  19   谢尔登·阿德尔森
19  20         马云

In [22]:
sub_df.iloc[0:10,0:1]    # 显示0-1列

   排名
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9   9

### 根据label

In [26]:
tail_df = df.tail()

In [27]:
tail_df

      排名      中文名     财富  年龄     财富来源    国家
196  197    大卫·格芬  84亿美元  75  电影，唱片公司    美国
197  198   吴亚军及家族  83亿美元  54      房地产  中国大陆
198  199  斯坦利·克伦克  83亿美元  70   体育，房地产    美国
199  200   泽维尔·尼尔  83亿美元  50   互联网，通信    法国
200  201   詹姆斯·欧文  83亿美元  89    多元化经营   加拿大

In [32]:
tail_df.loc[197:199 , '排名':'年龄']

      排名      中文名     财富  年龄
197  198   吴亚军及家族  83亿美元  54
198  199  斯坦利·克伦克  83亿美元  70
199  200   泽维尔·尼尔  83亿美元  50